# 1
my_list_1 = [2, 5, 8, 2, 12, 12, 4, 2, 2, 2, 2, 2, 2, 2, 2]
my_list_2 = [2, 7, 12, 3]

for item in my_list_2:
    while item in my_list_1:
        my_list_1.remove(item)

print(my_list_1)

# 2
date = '02.11.2013'
mm_dict = {
    '01': 'January',
    '02': 'February',
    '03': 'March',
    '04': 'April',
    '05': 'May',
    '06': 'June',
    '07': 'July',
    '08': 'August',
    '09': 'September',
    '10': 'October',
    '11': 'November',
    '12': 'December'}
dd_dict = {'01': 'первое', '02': 'второе', '03': 'третье', '04': 'четвёртое', '05': 'пятое', '06': 'шестое',
           '07': 'седьмое', '08': 'восьмое', '09': 'девятое', '10': 'десятое', '11': 'одиннадцатое',
           '12': 'двенадцатое', '13': 'тренадцатое', '14': 'четырнадцатое', '15': 'пятнадцатое',
           '16': 'шестнадцатое', '17': 'семнадцатое', '18': 'восемнадцатое', '19': 'девятнадцатое',
           '20': 'двадцатое', '21': 'двадцать первое', '22': 'двадцать второе', '23': 'двадцать третье',
           '24': 'двадцать четвёртое', '25': 'двадцать пятое', '26': 'двадцать шестое', '27': 'двадцать седьмое',
           '28': 'двадцать восьмое', '29': 'двадцать девятое', '30': 'тридцатое', '31': 'тридцать первое'
           }

print('{} = {} {} {}'.format(date, dd_dict.get(date[:2]), mm_dict.get(date[3:5]), date[-4:]))

# 3
my_list_1 = [2, 2, 5, 12, 8, 2, 12]
my_list_unique = list()

for i in set(my_list_1):
    if my_list_1.count(i) == 1:
        my_list_unique.append(i)

print(my_list_unique)
